dev/quickstart.org
#+TITLE: /Zen Server Quick Start/

#+OPTIONS: num:nil toc:nil ^:{}

#+BEGIN_SRC: none
    /==================================\
 ====                                  ====
/     Zen Social Adventure Game Server     \
====   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   ====
\    Copyright (C) 2010 Lyndon Tremblay    /
 ====                                  ====
    \==================================/
#+END_SRC

* Running the server

  + To start the Erlang shell:

    : ./erl-dev.sh

  + To run the server from there:

    : zen:start_all().

  + To see other commands:

    : help().

  + Optionally generate the Edoc documentation:

    : mkdoc(zen).

  + Which ends up at:

    : ./priv/www/edoc/
    : http://localhost:8000/edoc/

* Setting Up Content

  + Now, make the full documentation with Emacs. Open and evaluate:

    : ./dev/export-org.el

    : M-x eval-buffer
    :   <or>
    : Emacs-Lisp > Evaluate Buffer

  + Then:

    : s-o
    :  <or>
    : M-: (zen-publish)

  + And finally, read and aborb it:

    : ./priv/www/org/
    : http://localhost:8000/org/


