quickstart.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>/Zen Server Quick Start/</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-09-23 21:44:44 MDT"/>
<meta name="author" content="Lyndon Tremblay"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title"><i>Zen Server Quick Start</i></h1>





<pre class="src src-none">    /==================================\
 ====                                  ====
/     Zen Social Adventure Game Server     \
====   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   ====
\    Copyright (C) 2010 Lyndon Tremblay    /
 ====                                  ====
    \==================================/
</pre>




<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Running the server </h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>
To start the Erlang shell:

<pre class="example">
./erl-dev.sh
</pre>


</li>
<li>
To run the server from there:

<pre class="example">
zen:start_all().
</pre>


</li>
<li>
To see other commands:

<pre class="example">
help().
</pre>


</li>
<li>
Optionally generate the Edoc documentation:

<pre class="example">
mkdoc(zen).
</pre>


</li>
<li>
Which ends up at:

<pre class="example">
./priv/www/edoc/
http://localhost:8000/edoc/
</pre>


</li>
</ul>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Setting Up Content </h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>
Now, make the full documentation with Emacs. Open and evaluate:

<pre class="example">
./org/export.el
</pre>


<pre class="example">
M-x eval-buffer
  &lt;or&gt;
Emacs-Lisp &gt; Evaluate Buffer
</pre>


</li>
<li>
Then:

<pre class="example">
s-o
 &lt;or&gt;
M-: (zen-publish)
</pre>


</li>
<li>
And finally, read and aborb it:

<pre class="example">
./priv/www/dev/
http://localhost:8000/dev/
</pre>



</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Lyndon Tremblay
</p>
<p class="date"> Date: 2010-09-23 21:44:44 MDT</p>
<p class="creator">HTML generated by org-mode 7.01h in emacs 23</p>
</div>
</div>
</body>
</html>
